<pre>
PHP
Hypertext Preprocessor
Мова програмування яка частіше за все використовується для задач бекенду

за аналогією з JS, PHP має подвійне розуміння
-частина (модуль) веб-сервера, яка продовжує оброблення запитів
-самостйний продукт для виконання програм

Для встановлення краще використовувати збірку (налаштовані між собою веб-сервер, PHP, 
СУБД та інше). Такими є XAMPP, OpenServer, Danver, ...
                                     сайт 1 (index.php)
веб-запит --> [Apache(веб-сервер)] < .... >
                                     сайт N (index.php)

веб-сервер приймає запит, розбирає його та запускає PHP 
файл у запитаному сайті   Те що виводить PHP, передається сервером як
відповідь на запит. 
Виведення PHP (як модуля) потрапляє не на екран,а в тіло HTML

- Тип мови - інтерпретатор (REPL)
- покоління 4GL
- парадигма - процедурна (з підтримкою ООП)

===========================================================\
для зручності роботи з кількома проєктами (сайтами) бажано налаштувати
локальний (віртуальний) хостінг
- папка з конфігурацією Apache (conf/extra/httpd-vhosts.conf)
- відкриваємо у редакторі httpd-vhosts.conf
</pre>
