<h1>Шаблонізація</h1>
<p>
    Приведення усіх сторінок сайту до однакового вигляду.
    Досягається двома підходами
</p>
<ul>
    <li>Відокремленням спільних частин та вкл їж до сторінок</li>
    <li>Створення єдиного шаблону в середену якого вставляються тіла сторінок</li>
</ul>
<p>
    Реалізація - через налаштування сервера (Apache).
    Створюємо в корені проєкту файл <code>.htaccess</code>
    У налаштуваннях хосту (vhost) додаємо інструкцію 
    <code>AllowOverride All</code>яка дозволяє приймати додаткові
    налаштування.
</p>